Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.2.68/svd/ATSAML10E15A.svd
            <register>
               <name>PID3</name>
               <description>Peripheral Identification 3</description>
               <addressOffset>0x1FEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CUSMOD</name>
                     <description>ARM CUSMOD</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>Revision Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID0</name>
               <description>Component Identification 0</description>
               <addressOffset>0x1FF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB0</name>
                     <description>Preamble Byte 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID1</name>
               <description>Component Identification 1</description>
               <addressOffset>0x1FF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLE</name>
                     <description>Preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCLASS</name>
                     <description>Component Class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID2</name>
               <description>Component Identification 2</description>
               <addressOffset>0x1FF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB2</name>
                     <description>Preamble Byte 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID3</name>
               <description>Component Identification 3</description>
               <addressOffset>0x1FFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB3</name>
                     <description>Preamble Byte 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="DSU">
         <name>DSU_EXT</name>
         <prependToName>DSU_EXT_</prependToName>
         <baseAddress>0x41002100</baseAddress>
      </peripheral>
      <peripheral>
         <name>EIC</name>
         <version>U28041.0.0</version>
         <description>External Interrupt Controller</description>
         <groupName>EIC</groupName>
         <prependToName>EIC_</prependToName>
         <baseAddress>0x40002800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x44</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>EIC_EXTINT_0</name>
            <value>3</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_1</name>
            <value>4</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_2</name>
            <value>5</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_3</name>
            <value>6</value>
         </interrupt>
         <interrupt>
            <name>EIC_OTHER</name>
            <value>7</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKSEL</name>
                     <description>Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CKSELSelect</name>
                        <enumeratedValue>
                           <name>CLK_GCLK</name>
                           <description>Clocked by GCLK</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_ULP32K</name>
                           <description>Clocked by ULP32K</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMICTRL</name>
               <description>Non-Maskable Interrupt Control</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>NMISENSE</name>
                     <description>Non-Maskable Interrupt Sense Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>NMISENSESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising-edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling-edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both-edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High-level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low-level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMIFILTEN</name>
                     <description>Non-Maskable Interrupt Filter Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMIASYNCH</name>
                     <description>Asynchronous Edge Detection Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NMIASYNCHSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIFLAG</name>
               <description>Non-Maskable Interrupt Flag Status and Clear</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>NMI</name>
                     <description>Non-Maskable Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Synchronization Busy Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINTEO</name>
                     <description>External Interrupt Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-secure Check Interrupt Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-secure Check Interrupt Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-secure Check Interrupt</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASYNCH</name>
               <description>External Interrupt Asynchronous Mode</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ASYNCH</name>
                     <description>Asynchronous Edge Detection Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCHSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
